<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"meta","backend":"4973cd70488ffcfe3e368a4d01fce88528dbe1339d2f2d2affb77095116a10e2","plan_job_ref":"Job Pull Request Checks #847 at https://github.com/GSA-TTS/FAC/actions/runs/6115008963","plan_hash":"d8f9e67e05b72c241aca5b554c53a3df17986c93435f6906ba4931e59a48d438","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan for __meta__
<details>
<summary>Plan: 8 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.environments["dev"].local_file.cf_org will be created
  + resource "local_file" "cf_org" {
      + content              = <<-EOT
            cf_org_name = "gsa-tts-oros-fac"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./../dev/orgname.auto.tfvars"
      + id                   = (known after apply)
    }

  # module.environments["dev"].local_file.providers-tf will be created
  + resource "local_file" "providers-tf" {
      + content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.50.2"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./../dev/providers-managed.tf"
      + id                   = (known after apply)
    }

  # module.environments["preview"].local_file.cf_org will be created
  + resource "local_file" "cf_org" {
      + content              = <<-EOT
            cf_org_name = "gsa-tts-oros-fac"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./../preview/orgname.auto.tfvars"
      + id                   = (known after apply)
    }

  # module.environments["preview"].local_file.providers-tf will be created
  + resource "local_file" "providers-tf" {
      + content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.50.2"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./../preview/providers-managed.tf"
      + id                   = (known after apply)
    }

  # module.environments["production"].local_file.cf_org will be created
  + resource "local_file" "cf_org" {
      + content              = <<-EOT
            cf_org_name = "gsa-tts-oros-fac"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./../production/orgname.auto.tfvars"
      + id                   = (known after apply)
    }

  # module.environments["production"].local_file.providers-tf will be created
  + resource "local_file" "providers-tf" {
      + content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.50.2"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./../production/providers-managed.tf"
      + id                   = (known after apply)
    }

  # module.environments["staging"].local_file.cf_org will be created
  + resource "local_file" "cf_org" {
      + content              = <<-EOT
            cf_org_name = "gsa-tts-oros-fac"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./../staging/orgname.auto.tfvars"
      + id                   = (known after apply)
    }

  # module.environments["staging"].local_file.providers-tf will be created
  + resource "local_file" "providers-tf" {
      + content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.50.2"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./../staging/providers-managed.tf"
      + id                   = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #847](https://github.com/GSA-TTS/FAC/actions/runs/6115008963)